content-org/posts/Blog/Hugo/Hugo.org
#+STARTUP: content
#+TITLE:	Hugo and org-mode
#+AUTHOR:	Shawn Dennis Lin
#+EMAIL:	ShawnDennisLin@gmail.com
#+DATE:	[2020-11-15 Wed]

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval no

#+HUGO_BASE_DIR: ../../../../
#+HUGO_SECTION: /posts/Blog/Hugo

#+hugo_menu: :menu sidebar :name Hugo and org-mode :identifier blog-hugo-and-org-mode :parent blog :weight auto
#+HUGO_CATEGORIES: Blog
#+HUGO_TAGS: Hugo org-mode
#+HUGO_DRAFT: false
#+hugo_custom_front_matter: :hero /posts/Blog/Hugo/images/Hugo.png

This is my note for Hugo

#+HUGO: more

** Install
To see [[https://gohugo.io/getting-started/installing/][Official Website]]

** Tutorials
- [[https://toha-guides.netlify.app/posts/getting-started/prepare-site/][Getting Started]](theme with Toha)
   
** Common command
*** Create Site
#+begin_src shell
hugo new site ./ -f=yaml --force
#+end_src
*** Add theme
#+begin_src shell
git submodule add https://github.com/hugo-toha/toha.git themes/toha
#+end_src
*** Run Site Locally
#+begin_src shell
hugo server -t toha -w
#+end_src
If you navigate to http://localhost:1313, you should see a basic site with Toha theme. In the next section, we are going to configure the site to look like the hugo-toha.github.io. As we have run the server in watch mode, any changes we make to the site will be instantly visible in the browser.

** Theme
You can find the theme from [[https://themes.gohugo.io/][themes.gohugo.io]], these is my recommended theme:
1. [[https://themes.gohugo.io/toha/][Toha]](Download) [[https://github.com/hugo-toha/toha][hugo-toha/toha]](GitHub) [[https://github.com/hugo-toha/guides][hugo-toha/guides]](GitHub)
   
** org-mode + Hugo
- [[https://ox-hugo.scripter.co/][ox-hugo]] 
- [[https://www.xianmin.org/post/ox-hugo/][博客写作流程之工具篇： emacs, orgmode, hugo & ox-hugo]]
- [[https://www.shanesveller.com/blog/2018/02/13/blogging-with-org-mode-and-ox-hugo/][Blogging with org-mode and ox-hugo]]

   
